# EnableSilhouettes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayModel..::..EnableSilhouettes Property
ViewDisplayModel Class See Also
---
True to show silhouettes edges. False to disable showing them.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool EnableSilhouettes { get; set; }
```

Visual Basic
---
```text
Public Property EnableSilhouettes As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool EnableSilhouettes {
	bool get ();
	void set (bool value);
}
```

# See Also
ViewDisplayModel Class
Autodesk.Revit.DB Namespace